#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cognitive_account.ca will be created
  + resource "azurerm_cognitive_account" "ca" {
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "westeurope"
      + name                               = "open-ai-test-west-europe-ca"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + project_management_enabled         = false
      + public_network_access_enabled      = true
      + resource_group_name                = "open-ai-test-west-europe-rg"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # azurerm_cognitive_deployment.cd will be created
  + resource "azurerm_cognitive_deployment" "cd" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "open-ai-test-west-europe-cd"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o"
          + version = "2024-11-20"
        }

      + sku {
          + capacity = 45
          + name     = "GlobalStandard"
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "open-ai-test-west-europe-rg"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>